IRP/src/BusinessProcesses/ExecutionProcesses/ExecutionProcesses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ExecutionProcesses</name>
  <task>Task.ExecutorTasks</task>
  <attributes>
    <name>Template</name>
    <type>
      <types>CatalogRef.ExecutionTemplates</types>
    </type>
  </attributes>
  <attributes>
    <name>ExecutionObject</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>CompletionDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Canceled</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CancellationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ExecutionStages</name>
    <attributes>
      <name>StageID</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>TasksStartTogether</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Description_en</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>Description_hash</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>Description_ru</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>Description_tr</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>TasksResult</name>
      <type>
        <types>EnumRef.TaskResults</types>
      </type>
    </attributes>
    <attributes>
      <name>TasksFailAction</name>
      <type>
        <types>EnumRef.TaskFailActions</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>StagesTasks</name>
    <attributes>
      <name>StageID</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>TaskID</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Description_en</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>Description_hash</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>Description_ru</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>Description_tr</name>
      <type>
        <types>DefinedType.typeDescription</types>
      </type>
    </attributes>
    <attributes>
      <name>Executor</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
    <attributes>
      <name>UserGroup</name>
      <type>
        <types>CatalogRef.UserGroups</types>
      </type>
    </attributes>
    <attributes>
      <name>Position</name>
      <type>
        <types>CatalogRef.EmployeePositions</types>
      </type>
    </attributes>
    <attributes>
      <name>Branch</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>ProfitLossCenter</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>Detailing</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>TaskType</name>
      <type>
        <types>EnumRef.TaskTypes</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

IRP/src/BusinessProcesses/ExecutionProcesses/ObjectModule.bsl
Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If TypeOf(FillingData) = Type("CatalogRef.ExecutionTemplates") Then
		StandardProcessing = False;
		
		ThisObject.Template = FillingData;
		ThisObject.ExecutionStages.Load(FillingData.ExecutionStages.Unload());
		ThisObject.StagesTasks.Load(FillingData.StagesTasks.Unload());
	EndIf;

EndProcedure

Procedure CompleteTasksBeforeCreateTasks(RoutePoint, TasksBeingFormed, StandardProcessing)
	//TODO: Insert the handler content
EndProcedure

Procedure CheckTasksCompletedConditionCheck(RoutePoint, Result)
	//TODO: Insert the handler content
EndProcedure

Procedure CompletionOnComplete(RoutePoint, Cancel)
	//TODO: Insert the handler content
EndProcedure
